
// الفرق بين encryption و hashing 

// encryption هو عبارة عن عملية تحويل البيانات الى صيغة غير مفهومة و يمكن استرجاعها مرة اخرى باستخدام مفتاح معين

// hashing هو عبارة عن عملية تحويل البيانات الى صيغة غير مفهومة و لا يمكن استرجاعها مرة اخرى و يتم استخدامه لتخزين كلمات المرور في قواعد البيانات

// async handler هو عبارة عن function بتاخد controller و بترجع function تانية بتاخد req, res, next و بتنفذ ال controller و لو حصل اى error بيتم التقاطه و تمريره لل global error handler

/*
الفرق بين ال not found و ال global error handler

ال not found هو عبارة عن middleware بيتم تنفيذه لما ال client يطلب endpoint غير موجود و بيرد عليه برسالة بتقول ان الصفحة غير موجودة 
ال global error handler هو عبارة عن middleware بيتم تنفيذه لما يحصل اى error فى ال controller و بيرد عليه برسالة بتقول ان حصل خطأ و بيحتوى على ال error message و ال error stack
*/ 


/*
JWT هو عبارة عن JSON Web Token و هو عبارة عن string بيحتوى على 3 اجزاء مفصولة بنقطتين و كل جزء بيحتوى على معلومات معينة
الجزء الاول بيحتوى على header و هو عبارة عن object بيحتوى على نوع ال token و algorithm المستخدم لتشفير ال token

*/

/*
الفرق بين  session و token

session هو عبارة عن طريقة لتخزين بيانات المستخدم على السيرفر و بيتم تخزين session id فى الكوكيز و بيتم استخدامه للتحقق من هوية المستخدم فى كل طلب بيتم ارساله للسيرفر       
token هو عبارة عن طريقة لتخزين بيانات المستخدم على العميل و بيتم تخزين token فى local storage او session storage و بيتم استخدامه للتحقق من هوية المستخدم فى كل طلب بيتم ارساله للسيرفر
*/

